app/views/users/index.html.erb

      <p>Badges: <%= user.num_badges %></p>
      <% if user.pokemons.any? %>
---
SELECT  1 AS one FROM "pokemons"  WHERE "pokemons"."user_id" = ? LIMIT 1  [["user_id", 1]]
SELECT "pokemons".* FROM "pokemons"  WHERE "pokemons"."user_id" = ?  [["user_id", 1]]