app/controllers/pokemons_controller.rb

  def edit
    @pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @pokemon = Pokemon.find(params[:id])
    @pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "pokemons" SET "description" = ?, "updated_at" = ? WHERE "pokemons"."id" = 2  [["description", "BIITCCHHH"], ["updated_at", "2014-10-21 07:09:36.449948"]]